{
  "_name_or_path": "haitengzhao/gimlet",
  "architectures": [
    "T5ForConditionalGeneration"
  ],
  "d_ff": 2048,
  "d_kv": 64,
  "d_model": 512,
  "decoder_start_token_id": 0,
  "dense_act_fn": "relu",
  "dropout_rate": 0.1,
  "eos_token_id": 1,
  "feed_forward_proj": "relu",
  "graph_args": {
    "apply_graphormer_init": true,
    "dropout": 0.0,
    "edge_type": "multi_hop",
    "encoder_attention_heads": 8,
    "encoder_embed_dim": 512,
    "encoder_layers": 6,
    "encoder_normalize_before": false,
    "graphonly_problem_type": "",
    "graphonly_readout": "mean",
    "loss_reduction_method": "token",
    "maskt2g": true,
    "max_nodes": 128,
    "multi_hop_max_dist": 5,
    "num_atoms": 4608,
    "num_classes": -1,
    "num_edge_dis": 128,
    "num_edges": 1536,
    "num_in_degree": 512,
    "num_out_degree": 512,
    "num_spatial": 512,
    "spatial_pos_max": 1024,
    "transformer_backbone": "gimlet"
  },
  "initializer_factor": 1.0,
  "is_encoder_decoder": true,
  "is_gated_act": false,
  "layer_norm_epsilon": 1e-06,
  "loss_reduction_method": "token",
  "model_type": "t5",
  "n_positions": 512,
  "num_decoder_layers": 6,
  "num_heads": 8,
  "num_layers": 6,
  "output_past": true,
  "pad_token_id": 0,
  "relative_attention_max_distance": 128,
  "relative_attention_num_buckets": 32,
  "task_specific_params": {
    "summarization": {
      "early_stopping": true,
      "length_penalty": 2.0,
      "max_length": 200,
      "min_length": 30,
      "no_repeat_ngram_size": 3,
      "num_beams": 4,
      "prefix": "summarize: "
    },
    "translation_en_to_de": {
      "early_stopping": true,
      "max_length": 300,
      "num_beams": 4,
      "prefix": "translate English to German: "
    },
    "translation_en_to_fr": {
      "early_stopping": true,
      "max_length": 300,
      "num_beams": 4,
      "prefix": "translate English to French: "
    },
    "translation_en_to_ro": {
      "early_stopping": true,
      "max_length": 300,
      "num_beams": 4,
      "prefix": "translate English to Romanian: "
    }
  },
  "torch_dtype": "float32",
  "transformers_version": "4.28.1",
  "use_cache": true,
  "vocab_size": 32100
}
